leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.eDMA.h
/*
 * S32K1xx.eDMA.h
 *
 *  Created on: 2020年8月5日
 *      Author: Master.HE
 */

#ifndef S32K1XX_EDMA_H_
#define S32K1XX_EDMA_H_

#include "S32K1xx.Type.h"


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */


/** DMA - Size of Registers Arrays */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define DMA_DCHPRI_COUNT                         4u
#define DMA_TCD_COUNT                            4u
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define DMA_DCHPRI_COUNT                         16u
#define DMA_TCD_COUNT                            16u
#endif

/** DMA - Register Layout Typedef */
typedef struct {
	__IO uint32_t CR;                                /**< Control Register, offset: 0x0 */
	__I  uint32_t ES;                                /**< Error Status Register, offset: 0x4 */
	uint8_t RESERVED_0[4];
	__IO uint32_t ERQ;                               /**< Enable Request Register, offset: 0xC */
	uint8_t RESERVED_1[4];
	__IO uint32_t EEI;                               /**< Enable Error Interrupt Register, offset: 0x14 */
	__O  uint8_t CEEI;                               /**< Clear Enable Error Interrupt Register, offset: 0x18 */
	__O  uint8_t SEEI;                               /**< Set Enable Error Interrupt Register, offset: 0x19 */
	__O  uint8_t CERQ;                               /**< Clear Enable Request Register, offset: 0x1A */
	__O  uint8_t SERQ;                               /**< Set Enable Request Register, offset: 0x1B */
	__O  uint8_t CDNE;                               /**< Clear DONE Status Bit Register, offset: 0x1C */
	__O  uint8_t SSRT;                               /**< Set START Bit Register, offset: 0x1D */
	__O  uint8_t CERR;                               /**< Clear Error Register, offset: 0x1E */
	__O  uint8_t CINT;                               /**< Clear Interrupt Request Register, offset: 0x1F */
	uint8_t RESERVED_2[4];
	__IO uint32_t INT;                               /**< Interrupt Request Register, offset: 0x24 */
	uint8_t RESERVED_3[4];
	__IO uint32_t ERR;                               /**< Error Register, offset: 0x2C */
	uint8_t RESERVED_4[4];
	__I  uint32_t HRS;                               /**< Hardware Request Status Register, offset: 0x34 */
	uint8_t RESERVED_5[12];
	__IO uint32_t EARS;                              /**< Enable Asynchronous Request in Stop Register, offset: 0x44 */
	uint8_t RESERVED_6[184];
	__IO uint8_t DCHPRI[DMA_DCHPRI_COUNT];           /**< Channel n Priority Register, array offset: 0x100, array step: 0x1 */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
	uint8_t RESERVED_7[3836];
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
	uint8_t RESERVED_7[3824];
#endif
	struct {                                         /* offset: 0x1000, array step: 0x20 */
		__IO uint32_t SADDR;                             /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
		__IO uint16_t SOFF;                              /**< TCD Signed Source Address Offset, array offset: 0x1004, array step: 0x20 */
		__IO uint16_t ATTR;                              /**< TCD Transfer Attributes, array offset: 0x1006, array step: 0x20 */
		union {                                          /* offset: 0x1008, array step: 0x20 */
				__IO uint32_t MLNO;                              /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array offset: 0x1008, array step: 0x20 */
			__IO uint32_t MLOFFNO;                           /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20 */
			__IO uint32_t MLOFFYES;                          /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled), array offset: 0x1008, array step: 0x20 */
		} NBYTES;
		__IO uint32_t SLAST;                             /**< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
		__IO uint32_t DADDR;                             /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
		__IO uint16_t DOFF;                              /**< TCD Signed Destination Address Offset, array offset: 0x1014, array step: 0x20 */
		union {                                          /* offset: 0x1016, array step: 0x20 */
			__IO uint16_t ELINKNO;                           /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1016, array step: 0x20 */
			__IO uint16_t ELINKYES;                          /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1016, array step: 0x20 */
		} CITER;
		__IO uint32_t DLASTSGA;                          /**< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20 */
		__IO uint16_t CSR;                               /**< TCD Control and Status, array offset: 0x101C, array step: 0x20 */
		union {                                          /* offset: 0x101E, array step: 0x20 */
			__IO uint16_t ELINKNO;                           /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101E, array step: 0x20 */
			__IO uint16_t ELINKYES;                          /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101E, array step: 0x20 */
		} BITER;
	} TCD[DMA_TCD_COUNT];
} eDMA_Type, *eDMA_MemMapPtr;

 /** Number of instances of the DMA module. */
#define DMA_INSTANCE_COUNT                       (1u)


/* DMA - Peripheral instance base addresses */
/** Peripheral DMA base address */
#define eDMA_BASE                                 (0x40008000u)
/** Peripheral DMA base pointer */
#define eDMA                                      ((eDMA_Type *)eDMA_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { eDMA_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { eDMA }
 /** Number of interrupt vector arrays for the DMA module. */
#define DMA_IRQS_ARR_COUNT                       (2u)
 /** Number of interrupt channels for the CHN type of DMA module. */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define DMA_CHN_IRQS_CH_COUNT                    (4u)
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define DMA_CHN_IRQS_CH_COUNT                    (16u)
#endif
 /** Number of interrupt channels for the ERROR type of DMA module. */
#define DMA_ERROR_IRQS_CH_COUNT                  (1u)
/** Interrupt vectors for the DMA peripheral type */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__))
#define DMA_CHN_IRQS                             { DMA0_IRQn, DMA1_IRQn, DMA2_IRQn, DMA3_IRQn }
#elif (defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__) || defined (__Target_S32K148__))
#define DMA_CHN_IRQS                             { DMA0_IRQn, DMA1_IRQn, DMA2_IRQn, DMA3_IRQn, DMA4_IRQn, DMA5_IRQn, DMA6_IRQn, DMA7_IRQn, DMA8_IRQn, DMA9_IRQn, DMA10_IRQn, DMA11_IRQn, DMA12_IRQn, DMA13_IRQn, DMA14_IRQn, DMA15_IRQn }
#endif
#define DMA_ERROR_IRQS                           { DMA_Error_IRQn }

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

